-----------------------------------------------------
--　data変数で、本体側から引数を受け取ることが出来ます。
-----------------------------------------------------
function number(str)
	local ret = tonumber(str)
	if ret==nil then
		return 100
	end
	return ret
end

obj.effect("色調補正", "明るさ", number(data[1]), "ｺﾝﾄﾗｽﾄ", number(data[2]), "輝度", number(data[3]), "彩度", number(data[4]))

-----------------------------------------------------
--　以下の形式で、スクリプトの説明をreturnします
-----------------------------------------------------
return {
	main = "色調補正を行います。",
	data1 = "明るさ（0-200）",
	data2 = "コントラスト（0-200）",
	data3 = "輝度（0-200）",
	data4 = "彩度（0-200）"
}
